# Trabalhando com Planilhas do Excel

In [1]:
import pandas as pd

In [20]:
df1 = pd.read_excel("C:/Users/Discover/Documents/LUCAS MARTINS/Python/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Aracaju.xlsx")
df2 = pd.read_excel("C:/Users/Discover/Documents/LUCAS MARTINS/Python/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Fortaleza.xlsx")
df3 = pd.read_excel("C:/Users/Discover/Documents/LUCAS MARTINS/Python/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Natal.xlsx")
df4 = pd.read_excel("C:/Users/Discover/Documents/LUCAS MARTINS/Python/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Recife.xlsx")
df5 = pd.read_excel("C:/Users/Discover/Documents/LUCAS MARTINS/Python/Cusro_Python_Pandas_Digital_Innovation-master/datasets/Salvador.xlsx")

In [21]:
# Mesma estrutura
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [22]:
# concatenar dfs
df = pd.concat([df1,df2,df3,df4,df5])

In [23]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [24]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [25]:
# Amostra do conjunto
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
53   Salvador 2019-01-01   39.50    1035     3
74    Aracaju 2018-01-01    7.86    1520     2
33      Natal 2018-01-11  759.00     854     2
1      Recife 2019-01-01   11.44     983     1
121     Natal 2019-01-02  100.70    1037     3

In [26]:
# Tipo de dados
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [27]:
# converter o tipo de dado
df["LojaID"] = df["LojaID"].astype("object")

In [28]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [29]:
# Verificar valores nulos
df.isnull().sum()

Cidade     0
Data       0
Vendas    11
LojaID     0
Qtde       0
dtype: int64

In [30]:
# Substituindo os valores nulos pela m√©dia
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [31]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [40]:
# Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [41]:
# Apagando as linhas nulas
df.dropna(subset=["Vendas"], inplace=True)

In [42]:
# Removendo linhas q tenha valores faltantes
df.dropna(how="all", inplace=True)

In [43]:
# Criando colunas
# Receita = vendas X qtd
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [34]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [35]:
# Criar coluna sem a coluna qntd
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [36]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [38]:
# Retornar maior receita
df["Receita"].max()

3544.0

In [44]:
# Menor receita
df["Receita"].min()

3.34

In [45]:
# Top 3 com base na coluna receita com maior receita
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [46]:
# Top 3 com pior receita
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [47]:
# Agrupar a soma da receita por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25000
Fortaleza     37913.97000
Natal        152307.75692
Recife        51936.51000
Salvador      40596.73000
Name: Receita, dtype: float64

In [48]:
# Ordenar o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0
70  Natal 2019-02-14   743.0    854     4   2972.0             4.0